# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка:
# • Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# • Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# • Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# • Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
# Вход
# От конзолата се четe 1 ред:
# · Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
# Изход
# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
# Примерен вход и изход
# 365 = 811,6
# 365 * 1.4 = 511 - 365 =  146, 365 - 146 = 219 shoes
# suit 219 *1.2 = 262.8 - 219 =  43.8 87.6, 219 - 43.8 = 175.2
# ball 175.2 / 4
#  ball 11.68
# 5.86
yearTax = float(input())
shoes = (yearTax * 1.4) - yearTax
totalShoes = yearTax - shoes
suit = (totalShoes * 1.2) - totalShoes
TotalSuit = totalShoes - suit
ball = (TotalSuit / 4)
accessories = (ball / 5)
print(float(totalShoes + + TotalSuit + ball + accessories + yearTax))

